---
layout: post
title: qwest actiontec gt701-wg PPOE on OpenWRT
tags:
- Actiontec
- Cracking/Hacking
- OpenWRT
status: publish
type: post
published: true
meta:
_edit_last: "1"
_wp_old_slug: qwest-actiontec-gt701-wg-ppoappoe-connection-details
---
I was having a difficult time yesterday trying to get my new <a href="http://openwrt.org/">OpenWRT</a> install
working on my Qwest DSL line. Here is how I got things working. I have yet to get the wireless interface
working with WPA, I've just been using a different wireless access point I had lying around.<br />
<br />
<del datetime="2010-03-28T16:08:22+00:00">Telnet into your DSL modem, and <code>cat /var/tmp/tr69para_pppoe</code>
    (if you connect with PPoE) or <code>cat /var/tmp/tr69para_pppoa</code> (if you connect with PPoA).</del><br />
<br />
Telnet into your gateway before flashing it and <code>cat /proc/[###]/cmdline</code> (where ### is the process number of pppd),
this will get you the exact command used, along with the user/password that your gateway is using to
login to the DSLAM. Save this command string for later!<br />
<br />
I used the latest Kamikaze release (as of 03/28/2010) [<a href="http://downloads.openwrt.org/kamikaze/8.09.2/ar7/openwrt-ar7-squashfs.bin">download</a>]
and my Windows XP laptop connected via an Ethernet switch to my Actiontec. I was having trouble with tnftp on Debian,
but I've heard it isn't too hard to get that working. You have to be pretty fast, because as soon as you plug in
your gateway you have ~3 seconds to ftp in. The username/password is adam2/adam2. No matter what IPv4 you have your
gateway normally set to, it defaults to 192.168.0.1 on boot.<br />
<br />
<blockquote>C:\Documents and Settings\Administrator\Desktop>ftp 192.168.0.1<br />
    Connected to 192.168.0.1.<br />
    220 ADAM2 FTP Server ready.<br />
    User (192.168.0.1:(none)): adam2<br />
    331 Password required for adam2.<br />
    Password:<br />
    230 User adam2 successfully logged in.<br />
    ftp> binary<br />
    200 Type set to I.<br />
    ftp> quote SETENV mtd5,0x90010000,0x903e0000<br />
    200 SETENV command successful<br />
    ftp> quote SETENV MAC_PORT,0<br />
    200 SETENV command successful<br />
    ftp> quote MEDIA FLSH<br />
    200 Media set to FLSH.<br />
    ftp> put "openwrt-ar7-squashfs.bin" "openwrt-ar7-squashfs.bin mtd5"<br />
    200 Port command successful.<br />
    150 Opening BINARY mode data connection for file transfer.<br />
    226 Transfer complete.<br />
    ftp: 2621444 bytes sent in 33.95Seconds 77.21Kbytes/sec.<br />
    ftp> quote REBOOT<br />
    221-Thank you for using the FTP service on ADAM2.<br />
    221 Goodbye.<br />
    Connection closed by remote host.<br />
    ftp> quit<br />
    <br />
    C:\Documents and Settings\Administrator\Desktop></blockquote>
Wait about 20 seconds before you <code>telnet 192.168.1.1</code> to set the initial root password.
Once you set the root password you are only allowed to login via SSH or the HTTP web interface.<br />
<br />
SSH in to your new install and remove the existing options in /etc/ppp/options on your new OpenWRT install,
and put the options we extracted earlier in the /etc/ppp/options file.<br />
<br />
My <code>/etc/ppp/options</code> file ended up looking like this:
<blockquote>user [username]@qwest.net<br />
    password [password]<br />
    nodetach<br />
    defaultroute<br />
    usepeerdns<br />
    mru 1492<br />
    maxfail 10<br />
    lcp-echo-failure 4<br />
    lcp-echo-interval 30</blockquote>
And my <code>/etc/config/network</code> file for the wan portion:
<blockquote>config atm-bridge<br />
    option unit     0<br />
    option encaps   llc<br />
    option vpi      0<br />
    option vci      32<br />
    option payload  bridged # some ISPs need this set to 'routed'<br />
    <br />
    <br />
    config interface wan<br />
    ##      PPPoE:<br />
    option ifname   nas0<br />
    option proto    pppoe<br />
    <br />
    ##      PPPoA:<br />
    #       option ifname   atm0<br />
    #       option proto    pppoa<br />
    option encaps   vc<br />
    option vpi      0<br />
    option vci      32</blockquote>
That should wrap things up. You might have to customize a few other things.
